Revit 2026 API

# GroupUngroupMembers Method

---

Ungroups the group.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ICollection<ElementId> UngroupMembers()
```
```vb
Public Function UngroupMembers As ICollection(Of ElementId)
```
```cpp
public:
ICollection<ElementId^>^ UngroupMembers()
```
```fsharp
member UngroupMembers : unit -> ICollection<ElementId>
```

#### Return Value

ICollectionElementIdIf successful, the ids of the members of group are returned.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown if the group cannot be ungrouped. |

Removes all the members from the group and deletes the group. Note that the reference to this group object will become invalid once this method is called.

#### Reference

Group Class

Autodesk.Revit.DB Namespace